export const cityOptions = [
  { value: 'Київ', label: 'Київ' },
  { value: 'Львів', label: 'Львів' },
  { value: 'Одеса', label: 'Одеса' },
  { value: 'Харків', label: 'Харків' },
  { value: 'Ужгород', label: 'Ужгород' },
];

export const clubsList = [
  { value: 'Sportlife', label: 'Sportlife' },
  { value: 'Apollo', label: 'Apollo' },
  { value: 'Gym', label: 'Gym' },
  { value: 'Планета Фітнес', label: 'Планета Фітнес' },
  { value: 'GYMMAXX', label: 'GYMMAXX' },
  { value: 'Hiitworks', label: 'Hiitworks' },
];

export const sportTypes = [
  { value: 'Бодибілдинг', label: 'Бодибілдинг' },
  { value: 'Фітнес', label: 'Фітнес' },
  { value: 'Аеробіка', label: 'Аеробіка' },
  { value: 'Йога', label: 'Йога' },
  { value: 'Пілатес', label: 'Пілатес' },
  { value: 'Кикбоксинг', label: 'Кикбоксинг' },
  { value: 'Тхеквондо', label: 'Тхеквондо' },
  { value: 'Бокси', label: 'Бокси' },
  { value: 'Групові заняття', label: 'Групові заняття' },
];

export const sportTypesProto = [
  'Бодибілдинг',
  'Пауерліфтинг',
  'Фітнес',
  'Кроссфіт',
  'Аеробіка',
  'Йога',
  'Пілатес',
  'Силовий тренінг',
  'Спринт на доріжці',
  'Тренування з вагами',
  'Танцювальна аеробіка',
  'Кикбоксинг',
  'Тхеквондо',
  'Фітнес-батл',
  'Кроссфіт на вулиці',
  'Бокси',
  'Тренування з власною вагою',
  'Групові заняття',
  'Робота з гирями',
  'Групові тренування для схуднення',
  'Степ-аеробіка',
  'Тренування для серцево-судинної системи',
  'ММА (мішані бойові мистецтва)',
  'Бодіфлекс',
  'Важка атлетика',
  'Функціональний тренінг',
  'Тренування для преса',
  'Тренування для спини',
  'Спортивна ходьба',
  'Калистеніка (вправи з власною вагою)',
  'Художня гімнастика',
  'Акробатика',
  'Силова аеробіка',
  'Реабілітація',
  'Шейпінг',
  'Тренування на кардіо-обладнанні',
  'Тренування на тренажерах',
  'Спортивний пілатес',
  'Групові заняття для вагітних',
  'Ретро-фітнес',
  'Силовий йога',
  'Бігові тренування',
  'Фітнес для людей старшого віку',
  'Тренування на координацію',
  'Спортивний танець',
  'Тренування для гнучкості',
  'Стретчінг',
  'Велотренажер',
  'Тренування на TRX (підвісний тренажер)',
  'Тренування з медболами',
  'Аквафітнес (водна аеробіка)',
  'Силові тренування для дівчат',
  'Парафітнес',
  'Тренування для схуднення з персональним тренером',
  'Вітамінно-спортивний тренінг',
  'Бос-упражнення',
  'Буткемп (військові тренування)',
];

export const equipmentTypes = ['Pool', 'Sauna', 'Court'];

type ObjectItem = {
  [key: string]: string;
};

type ArrOfObj = ObjectItem[];

export const arrayToObjectsArray = (arr: string[]) => {
  let newArray: ArrOfObj = [];
  newArray = arr.map(item => ({ value: item, label: item }));
  console.log(' -newArray -> ', newArray);
};
