export const REGEXP = {
  email: {
    reg: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.(?!ru))+[a-zA-Z]{2,3}))$/,
    mes: {
      required: 'Поле обов’язкове для заповнення',
      mismatch: 'Введіть коректний email',
      mismatchSymbol: "Email має містити '@'",
    },
  },
  password: {
    reg: /^(?=(.*\d){1})(?=.*[a-z]{1})(?=.*[A-Z]{1})(?=.*[!?@#$%^&*()\-_=+\][{}|;:'"\\,.<>\/]{1})[0-9a-zA-Z!?@#$%^&*()\-_=+\][{}|;:'"\\,.<>\/]{8,32}$/,

    mes: {
      required: 'Поле обов’язкове для заповнення',
      mismatchLessSymbols: 'Пароль має містити не менше ніж 6 символів',
      mustBeSame: 'Паролі не збігаються',
    },
  },
  // phone: {
  //   reg: /^\+\d{12}$/,
  //   mes: {
  //     required: 'Введіть номер телефону',
  //     mismatch: 'Введіть правильний номер телефону',
  //   },
  // },
};
